setTimeout(() => {
  console.log("============= Решение задач  =============");
}, 3000);

/* 
 1. Написать функцию, объявленную стандартно, которая принимает
 в себя две строки, объединяет их в одну и возвращает результат.
 Результат вывести в консоль
*/

/* 
 2. Написать стрелочную функцию, которая принимает в себя одно
 число от 1 до 9999 и возвращает результат сложения первой 
 и последней цифры. Если число меньше 10, то просто возвращает 
 переданное число. Результат вывести в консоль
*/

/* 
 3. Передать в console.log() анонимную функцию, которая ничего
 не принимает в аргументы и просто возвращает рандомное число.
*/

/* 
 4. Изучить что такое setInterval(). Передать в setInterval() 
 анонимную функцию, которая каждую секунду прибавляет счетчик,
 изначально равный нулю, и выводит его в консоль, пока тот не 
 достигнет 10. После того, как счетчик достигнет числа 10, 
 выводить в консоль "Лимит исчерпан". 
*/

/* 
 5. Написать стрелочную функцию в упрощенном виде (функция, которая
  записана без фигурных скобок и без return), которая принимает в себя 
  два числа: минимальное и максимальное значение дизапазона и 
  возвращает целое рандомное число из этого диапазона. Результат
  вывести в консоль.
*/

/* 
 6. Написать рекурсивную функцию (стандратную или стрелочную), 
 которая увеличивает счетчик от 0 до 10 вызывая саму себя. 
 В функции должен быть conosole.log(), который выводит число
 счетчика.
*/

/* 
 7. Написать рекурсивную функцию (стандратную или стрелочную), 
 которая увеличивает счетчик от 0 до 10 вызывая саму себя. 
 В функции должен быть setTimeout(), в котором функция будет
 вызывать саму себя раз в секунду и выводить в консоль число счетчика.
*/
