setTimeout(() => {
  console.log("============= Решение задач  =============");
}, 3000);

/* 
 1. Написать функцию, объявленную стандартно, которая принимает
 в себя две строки, объединяет их в одну и возвращает результат.
 Соединить строки нужно через косые кавычки и с использованием ${}.
 Результат вывести в консоль.
*/

/* 
 2. Передать в console.log() анонимную функцию, которая принимает
 в себя одну строку типа "Имя Фамилия Отчество". Результатом
 выполнения функции будет строка с инициалами "И. Ф. О.". Если 
 в принимаемой функцией строке не будет двух пробелов, то вернуть ошибку
 console.error() и досрочно выйти из функции. Результат вывести в консоль
*/

/* 
 3. Написать стрелочную функцию, которая принимает в себя одну
 строку. Функция должна проверить, содержится ли в этом слове буква
 "ф" или "Ф" и в зависимости от результата вернуть false или true. 
 Результат вывести в консоль.
*/

/* 
 4. Написать функцию (любого типа), которая принимает
 в себя одну строку типа "Имя Фамилия Отчество". Функция должна
 вернуть только фамилию. Результат выполенения функции и длину 
 полученной строки вывести в консоль.
*/
